alibaba/AliOS-Things/platform/mcu/stm32l475/Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_audio.c
  return AUDIO_OK;
}

/**
  * @brief  De-Initializes microphone related peripherals.
  * @retval BSP AUDIO status

  */
uint8_t BSP_AUDIO_IN_DeInit(void)
{
  if (hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    /* De-initializes the Digital Filter for Sigma-Delta Modulators interface */
    if (AUDIO_DFSDMx_DeInit() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  else
  {
    /* INPUT_DEVICE_ANALOG_MIC */
    /* Check if output device is currently used */
    if (hAudioOut.OutputDevice != 0)
    {
      /* Reset record path on audio codec */
      if (hAudioOut.AudioDrv->Init(AUDIO_I2C_ADDRESS,
                                   hAudioOut.OutputDevice,
                                   (uint8_t) hAudioOut.Volume,
                                   hAudioOut.Frequency) != 0)
      {
        return AUDIO_ERROR;
      }
    }
    else
    {
      /* De-initializes SAI interface */
      if (AUDIO_SAIx_DeInit() != AUDIO_OK)
      {
        return AUDIO_ERROR;
      }

      /* DeInit audio codec */
      hAudioIn.AudioDrv->DeInit();
    }
  }

  /* Disable SAI PLL if no more device is used */
  if (hAudioOut.OutputDevice == 0)
  {
    if (AUDIO_SAIx_PLL_DISABLE() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }

  /* Reset the audio input context */
  memset(&hAudioIn, 0, sizeof(hAudioIn));

  return AUDIO_OK;
}

/**
  * @brief  Starts audio recording.
  * @param  pbuf: Main buffer pointer for the recorded data storing
  * @param  size: Current size of the recorded buffer
  * @note   The Right channel is start at first with synchro on start of Left channel
  * @retval BSP AUDIO status
  */
uint8_t BSP_AUDIO_IN_Record(uint16_t *pbuf, uint32_t size)
{
  hAudioIn.pRecBuf = pbuf;
  hAudioIn.RecSize = size;


  if (hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC1) == INPUT_DEVICE_DIGITAL_MIC1)
    {
      /* Allocate hAudioIn.LeftRecBuff buffer */
#if defined(BSP_AUDIO_USE_RTOS)
      hAudioIn.LeftRecBuff  = (int32_t *)k_malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#else
      hAudioIn.LeftRecBuff  = (int32_t *)malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#endif
      if (hAudioIn.LeftRecBuff == NULL)
      {
        return AUDIO_ERROR;
      }
    }
    
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC2) == INPUT_DEVICE_DIGITAL_MIC2)
    {
      /* Allocate hAudioIn.RightRecBuff buffer */
#if defined(BSP_AUDIO_USE_RTOS)
      hAudioIn.RightRecBuff  = (int32_t *)k_malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#else
      hAudioIn.RightRecBuff  = (int32_t *)malloc((size / hAudioIn.ChannelNbr) * sizeof(int32_t));
#endif
      if (hAudioIn.RightRecBuff == NULL)
      {
        return AUDIO_ERROR;
      }
    }
    
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC2) == INPUT_DEVICE_DIGITAL_MIC2)
    {
      /* Call the Media layer start function for right channel */
      if (HAL_DFSDM_FilterRegularStart_DMA(&BSP_AUDIO_hDfsdmRightFilter,
                                           (int32_t *)hAudioIn.RightRecBuff,
                                           (hAudioIn.RecSize / hAudioIn.ChannelNbr)) != HAL_OK)
      {
        return AUDIO_ERROR;
      }
    }
    
    if ((hAudioIn.InputDevice & INPUT_DEVICE_DIGITAL_MIC1) == INPUT_DEVICE_DIGITAL_MIC1)
    {
      /* Call the Media layer start function for left channel */
      if (HAL_DFSDM_FilterRegularStart_DMA(&BSP_AUDIO_hDfsdmLeftFilter,
                                           (int32_t *)hAudioIn.LeftRecBuff,
                                           (hAudioIn.RecSize / hAudioIn.ChannelNbr)) != HAL_OK)
      {
        return AUDIO_ERROR;
      }
    }
  }
  else
  {
    /* INPUT_DEVICE_ANALOG_MIC */
    /* Call the audio Codec Play function */
    if (hAudioIn.AudioDrv->Play(AUDIO_I2C_ADDRESS, pbuf, size) != 0)
    {
      return AUDIO_ERROR;
    }

    /* Start the process receive DMA */
    if (HAL_OK != HAL_SAI_Receive_DMA(&BSP_AUDIO_hSai_Rx, (uint8_t *)pbuf, size))
    {
      return AUDIO_ERROR;
    }
  }

  return AUDIO_OK;
}

/**
  * @brief  Updates the audio frequency.
  * @param  AudioFreq: Audio frequency used to record the audio stream.
  * @note   This API should be called after the BSP_AUDIO_IN_Init() to adjust the
  *         audio frequency.
  * @retval BSP AUDIO status
  */
uint8_t BSP_AUDIO_IN_SetFrequency(uint32_t AudioFreq)
{
  uint8_t TxData[2] = {0x00, 0x00};

  /* Configure the SAI PLL according to the requested audio frequency */
  if (AUDIO_SAIPLLConfig(AudioFreq) != AUDIO_OK)
  {
    return AUDIO_ERROR;
  }

  if (hAudioIn.InputDevice != INPUT_DEVICE_ANALOG_MIC)
  {
    /* De-initializes the Digital Filter for Sigma-Delta Modulators interface */
    if (AUDIO_DFSDMx_DeInit() != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }

    /* Initializes the Digital Filter for Sigma-Delta Modulators interface */
    if (AUDIO_DFSDMx_Init(AudioFreq) != AUDIO_OK)
    {
      return AUDIO_ERROR;
    }
  }
  else
  {
    /* INPUT_DEVICE_ANALOG_MIC */
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE(&BSP_AUDIO_hSai_Tx);
    __HAL_SAI_DISABLE(&BSP_AUDIO_hSai_Rx);

    /* Update the SAI audio frequency configuration */
    BSP_AUDIO_hSai_Tx.Init.Mckdiv = SAIClockDivider(AudioFreq);
    HAL_SAI_Init(&BSP_AUDIO_hSai_Tx);
    BSP_AUDIO_hSai_Rx.Init.Mckdiv = SAIClockDivider(AudioFreq);
    HAL_SAI_Init(&BSP_AUDIO_hSai_Rx);

    /* Enable SAI peripheral to generate MCLK */
    __HAL_SAI_ENABLE(&BSP_AUDIO_hSai_Tx);
    /* Transmit one byte to start FS generation */
    if (HAL_SAI_Transmit(&BSP_AUDIO_hSai_Tx, TxData, 2, 1000) != HAL_OK)
    {
      return AUDIO_ERROR;
    }
  }

  hAudioIn.Frequency = AudioFreq;

  return AUDIO_OK;
}

/**
  * @brief  Regular conversion complete callback.
  * @note   In interrupt mode, user has to read conversion value in this function
            using HAL_DFSDM_FilterGetRegularValue.
  * @param  hdfsdm_filter : DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  uint32_t index;
  uint32_t recbufsize = (hAudioIn.RecSize / hAudioIn.ChannelNbr);

  if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC)
  {
    for (index = (recbufsize / 2); index < recbufsize; index++)
    {
      hAudioIn.pRecBuf[2 * index]       = (uint16_t)(SaturaLH((hAudioIn.LeftRecBuff[index] >> 8), -32768, 32767));
      hAudioIn.pRecBuf[(2 * index) + 1] = (uint16_t)(SaturaLH((hAudioIn.RightRecBuff[index] >> 8), -32768, 32767));
    }
  }
  else if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC1)
  {
    for (index = (recbufsize / 2); index < recbufsize; index++)
    {
      hAudioIn.pRecBuf[index] = (uint16_t)(SaturaLH((hAudioIn.LeftRecBuff[index] >> 8), -32768, 32767));
    }
  }
  else if (hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC2)
  {
    for (index = (recbufsize / 2); index < recbufsize; index++)
    {
      hAudioIn.pRecBuf[index] = (uint16_t)(SaturaLH((hAudioIn.RightRecBuff[index] >> 8), -32768, 32767));
    }
  }

  /* Invoke the registered 'TransferCompete' callback function (if any) */
  if (hAudioIn.CbTransferComplete != (Audio_CallbackTypeDef)NULL)
  {
    if (hdfsdm_filter == &BSP_AUDIO_hDfsdmLeftFilter)
    {
      if (DmaLeftRecBuffCplt)
      {
        BSP_ErrorHandler();
      }

      DmaLeftRecBuffCplt = 1;
    }
    else
    {
      if (DmaRightRecBuffCplt)
      {
        BSP_ErrorHandler();
      }

      DmaRightRecBuffCplt = 1;
    }

